cf_billing/InformationRegisters/энргПоставщикиУслугМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПоставщикиУслугМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастьСоставной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПоставщикиУслугМКД/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет схему поставщики услуг МКД.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуПоставщикиУслугМКД(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "ПоставщикиУслугМКД") Экспорт
	Если Схема = Неопределено Тогда
		Схема 							= Новый СхемаЗапроса;
		Пакет 							= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаПоставщикиУслугМКД());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 			= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Параметры;	
	ПараметрПериод 						= Параметры[0];
	
	Если ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1",ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;

	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 				= "Организация, Район, МКД, ТочкаУчета, Услуга, ЧастьСоставной";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПоставщикиУслугМКД()
	
	Текст  =
	"ВЫБРАТЬ
	|	ПоставщикиУслугМКД.Организация КАК Организация,
	|	ПоставщикиУслугМКД.Район КАК Район,
	|	ПоставщикиУслугМКД.МКД КАК МКД,
	|	ПоставщикиУслугМКД.ТочкаУчета КАК ТочкаУчета,
	|	ПоставщикиУслугМКД.Услуга КАК Услуга,
	|	ПоставщикиУслугМКД.ЧастьСоставной КАК ЧастьСоставной,
	|	ПоставщикиУслугМКД.Поставщик КАК Поставщик
	|ИЗ
	|	РегистрСведений.энргПоставщикиУслугМКД.СрезПоследних КАК ПоставщикиУслугМКД";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
